import 'package:flutter/material.dart';
import '/backend/api_requests/api_manager.dart';
import 'backend/supabase/supabase.dart';
import 'package:shared_preferences/shared_preferences.dart';
import 'flutter_flow/flutter_flow_util.dart';

class FFAppState extends ChangeNotifier {
  static FFAppState _instance = FFAppState._internal();

  factory FFAppState() {
    return _instance;
  }

  FFAppState._internal();

  static void reset() {
    _instance = FFAppState._internal();
  }

  Future initializePersistedState() async {}

  void update(VoidCallback callback) {
    callback();
    notifyListeners();
  }

  String _polzCity = '';
  String get polzCity => _polzCity;
  set polzCity(String value) {
    _polzCity = value;
  }

  String _polzCompany = '';
  String get polzCompany => _polzCompany;
  set polzCompany(String value) {
    _polzCompany = value;
  }

  String _polzSurname = '';
  String get polzSurname => _polzSurname;
  set polzSurname(String value) {
    _polzSurname = value;
  }

  String _polzName = '';
  String get polzName => _polzName;
  set polzName(String value) {
    _polzName = value;
  }

  String _polzIIN = '';
  String get polzIIN => _polzIIN;
  set polzIIN(String value) {
    _polzIIN = value;
  }

  String _polzPfone = '';
  String get polzPfone => _polzPfone;
  set polzPfone(String value) {
    _polzPfone = value;
  }

  String _polzRoll = '';
  String get polzRoll => _polzRoll;
  set polzRoll(String value) {
    _polzRoll = value;
  }

  String _polzID = '';
  String get polzID => _polzID;
  set polzID(String value) {
    _polzID = value;
  }

  String _polzEmail = '';
  String get polzEmail => _polzEmail;
  set polzEmail(String value) {
    _polzEmail = value;
  }

  bool _polzPersonalData = false;
  bool get polzPersonalData => _polzPersonalData;
  set polzPersonalData(bool value) {
    _polzPersonalData = value;
  }

  String _blIDcard = '';
  String get blIDcard => _blIDcard;
  set blIDcard(String value) {
    _blIDcard = value;
  }

  List<String> _blPfoto = [];
  List<String> get blPfoto => _blPfoto;
  set blPfoto(List<String> value) {
    _blPfoto = value;
  }

  void addToBlPfoto(String value) {
    blPfoto.add(value);
  }

  void removeFromBlPfoto(String value) {
    blPfoto.remove(value);
  }

  void removeAtIndexFromBlPfoto(int index) {
    blPfoto.removeAt(index);
  }

  void updateBlPfotoAtIndex(
    int index,
    String Function(String) updateFn,
  ) {
    blPfoto[index] = updateFn(_blPfoto[index]);
  }

  void insertAtIndexInBlPfoto(int index, String value) {
    blPfoto.insert(index, value);
  }

  DateTime? _DateVydachi;
  DateTime? get DateVydachi => _DateVydachi;
  set DateVydachi(DateTime? value) {
    _DateVydachi = value;
  }

  String _idCardBL = '';
  String get idCardBL => _idCardBL;
  set idCardBL(String value) {
    _idCardBL = value;
  }

  String _polzOtchestvo = '';
  String get polzOtchestvo => _polzOtchestvo;
  set polzOtchestvo(String value) {
    _polzOtchestvo = value;
  }

  bool _Soglasie = false;
  bool get Soglasie => _Soglasie;
  set Soglasie(bool value) {
    _Soglasie = value;
  }

  bool _soglashenie = false;
  bool get soglashenie => _soglashenie;
  set soglashenie(bool value) {
    _soglashenie = value;
  }

  String _textSoglasie =
      '\"\"\"\n[DATE]\n\n      В соответствии с Законом Республики Казахстан от 21 мая 2013 года №94-V «О персональных данных и их защите» и иными законами и актами Республики Казахстан (далее – Закон),  я, [USER_SURNAME] [USER_NAME] [USER_OTCHESTVO], ИИН - [USER_IIN], пользователь мобильного приложения \"R-PASS\" (далее - Сервис) даю свое согласие ИП \"RONAT-Astana\" (далее - Оператор) на обработку моих персональных данных, не противоречащими законодательству Республики Казахстан способами, в той мере насколько это необходимо.\n\n      1. Перечень персональных данных\n    Обработка распространяется на следующие категории персональных данных:\n    Идентификационные данные: фамилия, имя, отчество, ИИН, реквизиты документа, удостоверяющего личность.\n    Контактные данные: номера телефонов, адрес электронной почты, иные контактные сведения.\n    Технические данные: IP-адрес, файлы cookie, данные о геолокации, иные автоматически собираемые сведения при использовании Сервиса.\n    Прочие сведения, необходимые для функционирования Сервиса и формирования документов в соответствии с законодательством Республики Казахстан.\n\n      2. Цели обработки персональных данных\n    обеспечение регистрации и доступа к Сервису;\n    взаимодействие с Пользователем (уведомления, запросы, техническая поддержка);\n    улучшение качества и функционала Сервиса;\n    проведение аналитических и статистических исследований на основе обезличенных данных;\n    исполнение требований законодательства Республики Казахстан.\n\n    3. Действия с персональными данными\n Оператор вправе осуществлять следующие операции:\nсбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (в т.ч. предоставление или доступ), обезличивание, блокирование, удаление и уничтожение персональных данных — с применением средств автоматизации или без них.\n\n      4. Дополнительные условия\n    Настоящее согласие предоставляется в электронной форме при регистрации на Сервисе.\n    Новая редакция Согласия вступает в силу с момента её размещения в Сервисе.\n    Пользователь обязуется самостоятельно отслеживать изменения Согласия в актуальной версии.\n    Оператор гарантирует принятие необходимых организационных и технических мер по защите персональных данных.\n\n      5. Срок дествия согласия:\n    Настоящее Согласие действует с момента его предоставления и в течение всего срока использования мною Сервиса, а также в течение  3 (трех) лет после прекращения использования Сервиса, если иное не предусмотрено законодательством РК.\n\n      6. Порядок отзыва согласия:\n    Я проинформирован(а) о том, что настоящее согласие может быть отозвано мною в любое время путем направления письменного уведомления Оператору по адресу электронной почты: ronat.astana@gmail.com. Отзыв согласия не влияет на законность обработки, основанной на согласии до его отзыва.\n\n      7. Подтверждение:\n    Нажимая кнопку «Зарегистрироваться» и/или устанавливая галочку в соответствующем поле, я подтверждаю, что:\n- я внимательно и в полном объеме ознакомился(ась) с настоящим Согласием.\n- все положения настоящего Согласия мне понятны.\n- я даю свое согласие на обработку моих персональных данных без каких-либо оговорок и ограничений.\n\n      Я, [USER_SURNAME]  [USER_NAME],  подтверждаю, что документ был представлен мне  через мобильное приложение \"R-PASS\", с документом ознакомлен и  согласен (что подтверждает наличие настоящего документа в PDF формате) \n\"\"\"';
  String get textSoglasie => _textSoglasie;
  set textSoglasie(String value) {
    _textSoglasie = value;
  }

  String _IDCompany = '';
  String get IDCompany => _IDCompany;
  set IDCompany(String value) {
    _IDCompany = value;
  }

  String _blPfotoSingl = '';
  String get blPfotoSingl => _blPfotoSingl;
  set blPfotoSingl(String value) {
    _blPfotoSingl = value;
  }

  String _textSoglashenie =
      '\"\"\"\n   Пользовательское соглашение  \n   (Публичная оферта) \n\nЭтот документ администратор компании принимает при регистрации. Он регулирует правила пользования сервисом.\n\nРеспублика Казахстан\nг. Астана\nДата последнего обновления: 08.09.2025 г.\n\n    Настоящее Пользовательское соглашение (далее – «Соглашение») является публичной офертой мобильного приложения \"R-PASS \", именуемого в дальнейшем «Платформа», в лице Администратора, действующего на основании доверенности, и адресовано любому юридическому лицу или индивидуальному предпринимателю, именуемому в дальнейшем «Пользователь», выразившему готовность воспользоваться услугами Платформы.\n     \n      1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ \n    1.1. Платформа — мобильное приложение «R-PASS », предназначена для внутреннего обмена информацией между компаниями, осуществляющими деятельность в сфере аренды автомобилей. \nСистема используется для фиксации фактов нарушений условий аренды со стороны клиентов и предотвращения повторных нарушений.\n    1.2 Владелец Приложения (далее - Владелец) - ИП \"RONAT-Astana\".\n    1.3. Пользователь — юридическое лицо или ИП, прошедшее процедуру верификации и регистрации, в лице его уполномоченного представителя (Администратора) принявшее условия настоящего Соглашения. \n    1.4. Администратор — уполномоченный представитель Пользователя, чья личность и полномочия были подтверждены Платформой (доверенностью). \n    1.5. Контент — любая информация, включая персональные данные третьих лиц (клиентов автопроката), текстовые описания, фотографии и иные материалы, размещаемые Пользователем на Платформе. \n    1.6. Учетная запись — персональная область Пользователя на Платформе, доступ к которой осуществляется с помощью логина и пароля.\n\n      2. ПРЕДМЕТ СОГЛАШЕНИЯ \n    2.1. Платформа предоставляет Пользователю неисключительное право использования функционала Платформы на условиях бесплатной (платной) подписки. \n    2.2. Пользователь обязуется использовать Платформу в соответствии с условиями настоящего Соглашения и действующим законодательством Республики Казахстан. \n    2.3. Акцептом настоящей оферты является завершение процедуры регистрации и оплаты подписки Пользователем.\n\n      3. РЕГИСТРАЦИЯ И ВЕРИФИКАЦИЯ \n    3.1. Для регистрации на Платформе представитель Пользователя обязан предоставить Платформе документы, подтверждающие его статус и полномочия (свидетельство о регистрации ИП/ТОО, приказ о назначении и т.д.). \n    3.2. Регистрация осуществляется Платформой в ручном режиме после проверки предоставленных документов. Платформа оставляет за собой право отказать в регистрации без объяснения причин.\n    3.3. После успешной верификации Платформа предоставляет Администратору данные для  доступа к Учетной записи. \n    3.4. Пользователь самостоятельно регистрирует своих сотрудников (Менеджеров) и несет полную административную и другую ответственность за их действия на Платформе, как за свои собственные.\n\n      4. ПРАВА И ОБЯЗАННОСТИ СТОРОН \n    4.1. Пользователь обязуется: \n  4.1.1. Предоставлять достоверные сведения при регистрации. \n  4.1.2. Своевременно оплачивать подписку согласно тарифам Платформы. \n  4.1.3. Нести полную и единоличную ответственность за размещаемый им Контент, его соответствие законодательству РК, достоверность и точность. \n  4.1.4. Гарантировать Платформе, что на размещение персональных данных третьих лиц (клиентов) в Контенте им было получено соответствующее письменное согласие этих лиц, как того требует Закон РК «О персональных данных и их защите». \n  4.1.5. Не передавать данные доступа к Учетной записи третьим лицам. \n    4.2. Платформа имеет право: \n  4.2.1. Временно заблокировать доступ Пользователя к Платформе в случае нарушения условий настоящего Соглашения или несвоевременной оплаты. \n  4.2.2. Удалять Контент или блокировать Учетные записи, нарушающие законодательство РК или права третьих лиц, без предварительного уведомления. \n  4.2.3. В одностороннем порядке изменять условия настоящего Соглашения и тарифы, уведомив Пользователей путем публикации новой версии на Платформе.\n    4.2.4. Платформа вправе вносить изменения в функционал приложения, интерфейс, структуру данных и иные компоненты без предварительного уведомления Пользователей.\n\n      5. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ (КЛЮЧЕВОЙ ПУНКТ) \n    5.1. Платформа предоставляется на условиях \"КАК ЕСТЬ\" (\"AS IS\"). Платформа не несет ответственности за достоверность, точность и законность Контента, размещаемого Пользователями. \n    5.2. Платформа является лишь информационным посредником и не несет ответственности за любые убытки, ущерб (включая упущенную выгоду) или вред чести, достоинству и деловой репутации, возникшие у Пользователей или третьих лиц в результате использования или невозможности использования Платформы. \n    5.3. Вся ответственность за содержание Контента и возможные претензии со стороны клиентов или государственных органов лежит исключительно на Пользователе, разместившем данный Контент. \n    5.4. Пользователь обязуется возместить Платформе убытки и расходы (включая разумные расходы на юридическую помощь), которые Платформа может понести в результате претензий третьих лиц, связанных с Контентом, размещённым данным Пользователем, в пределах, допускаемых действующим законодательством Республики Казахстан.\n\n      6.  Ответственность сторон\n    6.1.  В случае нарушения условий настоящего Соглашения, повлекшего причинение вреда всем или одной из сторон Соглашения, виновная сторона несет ответственность в соответствии с законодательством Республики Казахстан.\n    6.2.  Администратор не несет ответственности за технические временные сбои и перерывы в работе Приложения и его компонентах, возникшие по независящим от Администратора, Владельца причинам или в случае проведения плановых или внеплановых мероприятий по обслуживанию Приложения и его компонентов.\n    6.3.  Владелец и Администратор не несут ответственности за временные сбои и перерывы в работе линий связи, иные аналогичные сбои, а также за неполадки компьютера, мобильного устройства связи, с которого Пользователь осуществляет доступ к Порталу и его компонентам.\n    6.4.  Владелец и Администратор не несут ответственности перед Пользователем за действия других Пользователей, и любых других участников Приложения и его компонентов.\n    6.5.  Владелец и Администратор не несут ответственности за любой прямой, косвенный ущерб, включая упущенную выгоду, ущерб от использования, потерю данных или какие-либо другие нематериальные потери, ущерб репутации и иной ущерб, возникающий вследствие:\n  1) пользования или невозможности пользования Приложения, и его компонентами Пользователями;\n  2) изменения условий Соглашения Владельцем и (или) Администратором;\n\n      7. ФИНАНСОВЫЕ УСЛОВИЯ \n    7.1. Стоимость подписки определяется тарифами, указанными на Платформе. \n    7.2. Оплата производится на основании выставленного счета или путем перевода на указанные реквизиты. \n    7.3. В случае отсутствия оплаты, доступ к Платформе блокируется до момента поступления средств.\n\n      8.  СРОК ДЕЙСТВИЯ И РАСТРЖЕНИЯ ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ\n    8.1.  Срок действия. Данное Соглашение начинает действовать в день, когда вы его примите (как описано в преамбуле выше) и действует пока вы используете Приложение, если не будет прекращено раньше в соответствии с данным Соглашением. \n    8.2.  Несмотря на вышесказанное, вы настоящим подтверждаете и соглашаетесь, что данное соглашение вступает в силу по наступлении события, которое случится первым (a) день, когда вы впервые использовали Приложение или (b) день, когда вы приняли данное Соглашение, которое остаётся в силе пока вы используете Приложение, если не будет прекращено раньше в соответствии с данным Соглашением.\n    8.3.  Расторжение с вашей стороны. Если вы хотите расторгнуть данное Соглашение, вы можете это сделать, просто удалив Приложение со своего мобильного устройства. После удаления Соглашение будет иметь силу в течении 1 (одного) года.\n    8.4.  Последствия расторжения. Расторжение данного Соглашения требует от вас удаления Приложения и полного прекращения его использования.  Все положения данного Соглашения, которые по своему характеру должны сохраняться, остаются в силе после расторжения, включая, в частности, положения о праве собственности, отказ от гарантийных обязательств и ограничение ответственности.\n    8.5.  Данное Приложение предназначено для использования только на территории Республики Казахстан. ИП \"RONAT-Astana\" не даёт никаких заверений, что Приложение будет работать в других странах.\n    8.6. Владелец Платформы имеет право в одностороннем порядке расторгнуть настоящее Соглашение и заблокировать доступ Пользователя в случае нарушения условий Соглашения, размещения недостоверной информации, либо злоупотребления функционалом Платформы.\n\n      9.  Прочие положения\n    9.1.  Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Республики Казахстан.\n    9.2.  Бездействие со стороны Администратора в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Владельца права предпринять позднее соответствующие действия в защиту своих интересов и защиту имущественных и неимущественных прав на охраняемые в соответствии с законодательством материалы Приложения.\n    9.3.  Никакие советы или информация, полученные устно или письменно от ИП \"RONAT-Astana\" или посредством приложения, не создают никаких гарантий.\n    9.4.  Форс-мажор. ИП \"RONAT-Astana\" не несёт ответственности за любые задержки или неисполнение, вызванные причинами, находящимися вне разумного контроля, включая, помимо прочего, стихийные бедствия, войны, терроризм, беспорядки, эмбарго, действия гражданских или военных властей, пожары, наводнения, несчастные случаи, забастовки или нехватку транспортных средств, топлива, энергии, рабочей силы или материалов.\n    9.5.  Вопросы, жалобы, претензии. Если у вас имеются какие-либо вопросы, жалобы или претензии в отношении данного Приложения, вы можете связаться с нами написав на ronat.astana@gmail.com\n    9.6.  Отказ от осуществления прав. Любой отказ или неисполнение какого-либо положения настоящего Соглашения в одном случае не будет считаться отказом от любого другого положения или такого положения в любом другом случае.\n\n      10. КОНФИДИЦИАЛЬНОСТЬ И ЗАЩИТА ДАННЫХ\n    10.1. Владелец и Платформа обрабатывают персональные данные Пользователей и их клиентов исключительно в целях функционирования Платформы, в соответствии с Законом Республики Казахстан «О персональных данных и их защите».\n    10.2. Платформа обязуется принимать все разумные меры для защиты персональных данных от несанкционированного доступа, изменения, раскрытия или уничтожения.\n     10.3. Пользователь, размещая персональные данные третьих лиц (клиентов), подтверждает получение их согласия на обработку и передачу данных в рамках использования Платформы.\n\n      11. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ \n    11.1. Все споры и разногласия решаются путем переговоров. В случае невозможности достижения согласия, споры передаются на рассмотрение в Специализированный межрайонный экономический суд города Астаны. \n    11.2. Во всем, что не урегулировано настоящим Соглашением, стороны руководствуются действующим законодательством Республики Казахстан.\n    11.3. Принятие условий настоящего Соглашения посредством интерфейса приложения является эквивалентом подписания бумажного экземпляра собственноручной подписью, в соответствии со статьёй 396 Гражданского кодекса Республики Казахстан.\n    \n    Данное соглашение было подписанно [USER_SURNAME] [USER_NAME] [USER_OTCHESTVO], ИИН: [USER_IIN], тел: [USER_PFONE], по средствам мобильного устройства. \n\"\"\"';
  String get textSoglashenie => _textSoglashenie;
  set textSoglashenie(String value) {
    _textSoglashenie = value;
  }

  String _usercompani = '';
  String get usercompani => _usercompani;
  set usercompani(String value) {
    _usercompani = value;
  }

  DateTime? _datePodpiski;
  DateTime? get datePodpiski => _datePodpiski;
  set datePodpiski(DateTime? value) {
    _datePodpiski = value;
  }

  String _temaEmail = '';
  String get temaEmail => _temaEmail;
  set temaEmail(String value) {
    _temaEmail = value;
  }

  String _soglasieOUT = '';
  String get soglasieOUT => _soglasieOUT;
  set soglasieOUT(String value) {
    _soglasieOUT = value;
  }

  String _soglashenieOUT = '';
  String get soglashenieOUT => _soglashenieOUT;
  set soglashenieOUT(String value) {
    _soglashenieOUT = value;
  }

  String _CityID = '';
  String get CityID => _CityID;
  set CityID(String value) {
    _CityID = value;
  }

  String _cityZapis = '';
  String get cityZapis => _cityZapis;
  set cityZapis(String value) {
    _cityZapis = value;
  }

  String _userEmail = '';
  String get userEmail => _userEmail;
  set userEmail(String value) {
    _userEmail = value;
  }

  String _userLogin = '';
  String get userLogin => _userLogin;
  set userLogin(String value) {
    _userLogin = value;
  }

  String _userphobe = '';
  String get userphobe => _userphobe;
  set userphobe(String value) {
    _userphobe = value;
  }

  String _userid = '';
  String get userid => _userid;
  set userid(String value) {
    _userid = value;
  }

  List<String> _photo = [];
  List<String> get photo => _photo;
  set photo(List<String> value) {
    _photo = value;
  }

  void addToPhoto(String value) {
    photo.add(value);
  }

  void removeFromPhoto(String value) {
    photo.remove(value);
  }

  void removeAtIndexFromPhoto(int index) {
    photo.removeAt(index);
  }

  void updatePhotoAtIndex(
    int index,
    String Function(String) updateFn,
  ) {
    photo[index] = updateFn(_photo[index]);
  }

  void insertAtIndexInPhoto(int index, String value) {
    photo.insert(index, value);
  }

  DateTime? _time;
  DateTime? get time => _time;
  set time(DateTime? value) {
    _time = value;
  }

  List<String> _testphoto = [];
  List<String> get testphoto => _testphoto;
  set testphoto(List<String> value) {
    _testphoto = value;
  }

  void addToTestphoto(String value) {
    testphoto.add(value);
  }

  void removeFromTestphoto(String value) {
    testphoto.remove(value);
  }

  void removeAtIndexFromTestphoto(int index) {
    testphoto.removeAt(index);
  }

  void updateTestphotoAtIndex(
    int index,
    String Function(String) updateFn,
  ) {
    testphoto[index] = updateFn(_testphoto[index]);
  }

  void insertAtIndexInTestphoto(int index, String value) {
    testphoto.insert(index, value);
  }

  String _searshFIO = '';
  String get searshFIO => _searshFIO;
  set searshFIO(String value) {
    _searshFIO = value;
  }

  String _idCompanyOut = '';
  String get idCompanyOut => _idCompanyOut;
  set idCompanyOut(String value) {
    _idCompanyOut = value;
  }

  String _idManager = '';
  String get idManager => _idManager;
  set idManager(String value) {
    _idManager = value;
  }
}
